<html>

<head>
<meta charset=”UTF-8”
<title> Primeira geração de computadores.</title>
<meta http-equiv=”Content-Type” content=”text/html; charset=utf-8">
</head>
<body>
<br>
<html>
<body>
<hr />
A primeira geraç&atilde;o de computadores iniciou-se em 1940, mas s&oacute; em 1950 que começou a evoluir, impulsionada pelo aparecimento dos sistemas operacionais, o que facilitou o uso dos computadores.
Colossus foi um dos primeiros computadores inventados, ele ocupava uma sala inteira e n&atilde;o possuia nem tela e nem memoria, criado em 1939, por <b>Alan Turing, Tommy Flowers, Bill Tutte e Max Newman</b>, 
com a intenç&atilde;o de decodificar mensagens trocadas pelos soldados nazistas, pois normalmente demorava cerca de 6 semanas para isso.
</br>
<img src="https://img.ibxk.com.br/2013/6/materias/9119619556173414.jpg">
<p>
<b> <h1> O primeiro computador eletro-mecânico automático. </b> </h2>
<hr/>
<b> O Mark I </b> era um computador que era totalmente eletromec&acirc;nico, ele foi constru&iacute;do em 1944 pelo
professor da Universidade de Harvard <b> Howard Aiken</b>, era um calculador de tabelas para o uso na navegaç&atilde;o.
A <b>IBM</b> financiava a construção do
calculador e o restante era financiado pela Marinha dos Estados Unidos da
América.
<br>
<br>
<p>
<img src="http://1.bp.blogspot.com/-YdcsjWlid9I/VOpwJ98WzeI/AAAAAAAAAD0/BLyxc5TKO5A/s1600/mark1.jpg width="235" height="300" align="middle"/> 
</p>
<br>
O Mark I tinha cerca de 17 metros de comprimento por 2,5 metros de altura e um peso de 5 toneladas. 
Em funcionamento, dizia-se que ele reproduzia um intenso ru&iacute;do,
a mem&oacute;ria e os totalizadores compreendiam 3 mil engrenagens com 10 "dentes", 1.400
comutadores rotativos e tudo era ligado por cerca de 800 Km de condutores el&eacute;ctricos. O
MARK I trabalhava números com 23 n&uacute;meros decimais e realizava as quatro operaç&oatilde;es aritmética,
também calculava funções logar&iacute;tmicas e trigonom&eacute;tricas, demorando de 3 a 5 segundos para efetuar uma multiplicaç&aatilde;o, mas
era totalmente autom&aacute;tico e podia realizar cálculos extensos sem intervenç&aatilde;o humana.
<br>
O MARK I seguiu com uma vers&aatilde;o totalmente eletr&ocirc;nica denominada MARK II, tamb&eacute;m
constru&iacute;da pelo professor Aiken, que começou a funcionar em 1947.
<br>
<b> <h1> Máquina de Turing. </b> </h2>
<hr />
A m&aacute;quina de Turing &eacute; um dispositivo imagin&aacute;rio e te&oacute;rico que formou a estrutura
para fundamentar a ci&eacirc;ncia da computaç&aatilde;o moderna.
O seu inventor, o matem&aacute;tico ingl&eacirc;s <b>Alan Mathison Turing</b> mostrou que a computaç&aatilde;o das operaç&oatilde;es de leitura
escrita dos s&iacute;mbolos bin&aacute;rios poderiam ser
satisfeitas por uma m&aacute;quina que continha uma fita
de comprimento ilimitado, com quadrados de
tamanho definido sobre ela e um dispositivo com um
n&uacute;mero finito de estados, que realizava as operaç&oatilde;es
na fita.
<br>
<b> <h1> O ENIAC. </b> </h2> 
<hr />
<b>William Mauchly </b> e John <b> Prester Eckert</b> junto com cientistas da Universidade da Pensilv&aacirc;nia e parceria com o governo estado unidense constru&iacute;ram o primeiro computador 
eletr&oacirc;nico, conhecido como <b>ENIAC</b> (Eletronic Numerical Integrator and Calculator). As id&eacute;ias de <b> John von Neumann </b>que s&aatilde;o utilizadas at&eacute; hoje fizeram 
com que os computadores pudessem ser programados atrav&eacute;s de programas, rotinas de manipulaç&aatilde;o de dados que se utilizam de instruç&oatilde;es pr&oacute;prias do computador.
<br>
<br>
O <b>ENIAC</b> era totalmente eletr&oacirc;nico, possu&iacue;a 17.468 v&aacute;lvulas e 500.000 conex&oatilde;es de solda, 30 toneladas de peso, 
5 metros de altura, 25 metros de comprimento e era duas vezes maior que MARK I, 
a v&aacute;lvula &eacute; um tubo de vidro do qual praticamente todo o g&aacute;s foi retirado, criando um ambiente de v&aacute;cuo, 
contendo  eletrodos  e  grades met&aacute;licas, cuja finalidade &eacute; controlar o fluxo de el&eacute;trons.
<br>
Fontes: <br> IME.USP, techtudo, Wkipedia, LF Bittencourt,.dca.fee.unicamp.br. </br>
<br>
<br>
</body>  
</html>
